use Турфирма
-----------------------------------------------------------------------------------------------------------------
select * from Sales_statement where full_price <1000 ---- вывести значения полной стоимости меньше 1000
go
select * from Tours where type_of_move ='автобус'---- вывести из таблицы Туры значения,которые равны автобусу
go
select * from Hotels where amount_of_seats <=150 ---количество мест в гостинице меньше либо равно 150
go
------------------------------------------------------------------------------------------------------------------
select * from Hotels where name ='Фараон' OR name= 'Мармарис' -------вывести записи , которые содержат Фараон или Мармарис
go
select * from Tourists where passport ='HI456' AND age=30 -------вывести записи , которые содержат номер паспорта HI456 и возраст 30
go
select * from Tourists where NOT sex='женский'------ вывести записи , в которых не содержится женский пол
go
-------------------------------------------------------------------------------------------------------
select* from Tourists where sex ='женский' AND age >=18 AND kids='нет' ---вывести записи , в которых содержится пол-женский, детей-нет и возраст больше либо равен 18
go
select * from Tours where price >4300 AND type_of_residense='одноместный'  AND type_of_food='все включено'---- вывести записи в которых цена больше 4300, тип проживания - одноместный и тип питания-все включено
go
 --------------------------------------------------------------------------------------------------------
 select * from Tours where price IN (65500,4300,10000)---- вывести записи, включающие в себя цены только 65500,4300,10000
 go
 select*from Tour_group where amount_of_tourists IN (14,20,35)-------- вывести записи, включающие в себя количество туристов только 14,20,35
 go
 ---------------------------------------------------------------------------------------------------------
 Select * from Tours where price BETWEEN 10000 AND 84000------ вывести записи, где цена в диапазоне от 10000 до 84000
 go
 Select * from Tour_group where amount_of_tourists NOT BETWEEN 20 AND 45--- вывести записи , в которых количество туристов не в диапазоне от  20 до 45
 go
  ------------------------------------------------------------------------------------------------------
 SELECT * FROM Tours where type_of_food Like '%ультра%'---вывести записи, в которых тип питания содержит слово ультра 
 go
 select* from Hotels where Upper (name) Like 'А%' ------- вывести записи , в которых название отеля содержит заглавную букву А
 go
 -------------------------------------------------------------------------------------------------------
 select * from Hotels where amount_of_seats IS NULL ------ вывести записи, в которых количество мест равно NULL
 go
 select * from Tours where price IS NULL-------- вывести записи , в которых цена равна NULL
 go
